# Chapter 7: Data Cleaning and Preparation

## 7.1 Handling Missing Data

In [9]:
import pandas as pd
import numpy as np

In [10]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [11]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [12]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool


### Filtering Out Missing Data

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.355605       NaN       NaN
1 -0.291322       NaN       NaN
2 -0.106878       NaN  0.554686
3 -0.780083       NaN  0.981392
4 -1.652013 -1.732305  2.240753
5  0.392484  0.081641 -0.769236
6 -0.465269  1.977385 -0.990338

In [24]:
df.dropna()
df.dropna(thresh=2)

          0         1         2
2 -0.106878       NaN  0.554686
3 -0.780083       NaN  0.981392
4 -1.652013 -1.732305  2.240753
5  0.392484  0.081641 -0.769236
6 -0.465269  1.977385 -0.990338

### Filtering Out Missing Data